
Процедура ПрошелТестНаАдминистрирование1СПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Результат = ПройденТестАдминистрирование;
КонецПроцедуры

Процедура ПрошелТестНаПрограммированиеВ1СПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	  Результат = ПройденТестПрограммирование;	
КонецПроцедуры

Процедура ВакансияОператораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Оператор1С;
КонецПроцедуры

Процедура ВакансияАдминистратора1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Администратор1С;
КонецПроцедуры

Процедура ВакансияПрограммиста1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ПредложеннаяВакансия = Перечисления.Вакансии.Программист1С;
КонецПроцедуры
