//ДвухзначноеЧисло = 11;
//Степень = 5;
//Результат = 1;

//Для Число = 1 По Степень  Цикл
//	Результат = Результат * ДвухзначноеЧисло;
//КонецЦикла;

//Сообщить(Результат);
//Если Результат >10000 Тогда
//	Сообщить("Число превышает 10 000");
//Иначе 
//	Сообщить ("Число не превышает 10 000");
//КонецЕсли;

//КонецГода=КонецГода(ТекущаяДата());
//Для Счетчик = 1 По 10 Цикл
//	ДеньНедели = ДеньНедели(КонецГода);	
//	Если ДеньНедели = 1 Тогда
//		Сообщить("Понедельник");
//	ИначеЕсли ДеньНедели = 2 Тогда
//		Сообщить("Вторник");
//	ИначеЕсли ДеньНедели = 3 Тогда
//		Сообщить("Среда");
//	ИначеЕсли ДеньНедели = 4 Тогда
//		Сообщить("Четверг");
//	ИначеЕсли ДеньНедели = 5 Тогда
//		Сообщить("Пятница");	
//	ИначеЕсли ДеньНедели = 6 Тогда
//		Сообщить("Суббота");
//	Иначе
//		Сообщить("Воскресенье");
//	КонецЕсли;
//	КонецГода = КонецГода(КонецДня(КонецГода)+1);
//КонецЦикла; 

//МассивЧисел = Новый Массив;
//МассивЧисел.Добавить(777);  
//МассивЧисел.Добавить(888);  
//Для каждого ЭлементМассива Из МассивЧисел Цикл
//  Сообщить(ЭлементМассива);
//КонецЦикла;